app/controllers/battles_controller.rb

INSERT INTO "battles" ("created_at", "updated_at", "photo_looser_id", "photo_winner_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-09-26 13:37:01.968088"], ["updated_at", "2017-09-26 13:37:01.968088"], ["photo_looser_id", 2], ["photo_winner_id", 7]]
---
  def create
    @battle = Battle.new(battle_params)

    if @battle.save