app/controllers/photos_controller.rb

  def create
    @photo = current_user.build_photo(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("user_id", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 10], ["source", "img3.jpg"], ["created_at", "2017-09-22 12:58:02.805929"], ["updated_at", "2017-09-22 12:58:02.805929"]]

  def update
    if @photo.update(photo_params)
---
UPDATE "photos" SET "source" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["source", "img3.jpg"], ["updated_at", "2017-09-22 23:40:14.603464"], ["id", 8]]

  def find_photo!
    @photo = current_user.photo
    unless @photo.present?
---
SELECT  "photos".* FROM "photos" WHERE "photos"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]