app/controllers/top_controller.rb

SELECT  "photos".* FROM "photos" ORDER BY "photos"."rating" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "photos"
---
  def index
    @tops = Photo.order(rating: :desc).paginate(page: params[:page],
                                                  per_page: 5)